In [12]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
}

df = pd.DataFrame(data)
print(df)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [14]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [16]:
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [18]:
print(df['Name'])   # Access the 'Name' column
print(df[['Name', 'Salary']])  # Access multiple columns

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000

In [22]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [26]:
df[['Name','Salary']]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000

In [28]:
df.Name

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [32]:
print(df.loc[1])   # Access row by index label
print(df.iloc[2])  # Access row by integer index

Name        Bob
Age          30
Salary    60000
Name: 1, dtype: object
Name      Charlie
Age            35
Salary      70000
Name: 2, dtype: object

In [34]:
df.index = ['a', 'b', 'c']
df

      Name  Age  Salary
a    Alice   25   50000
b      Bob   30   60000
c  Charlie   35   70000

In [38]:
df.loc["b"]

Name        Bob
Age          30
Salary    60000
Name: b, dtype: object

In [42]:
df.iloc[2]

Name      Charlie
Age            35
Salary      70000
Name: c, dtype: object

In [54]:
df['Bonus'] = df['Salary']*0.1
df

      Name  Age  Salary   Bonus
a    Alice   25   50000  5000.0
b      Bob   30   60000  6000.0
c  Charlie   35   70000  7000.0

In [62]:
df[df['Age']>25] # Show rows where Age > 28

      Name  Age  Salary   Bonus
b      Bob   30   60000  6000.0
c  Charlie   35   70000  7000.0

In [90]:
#Basic Statistics
print(df.describe())  # Summary statistics
print(df.mean(numeric_only=True))      # Mean of numeric columns #Name column ignored

        Age   Salary   Bonus
count   3.0      3.0     3.0
mean   30.0  60000.0  6000.0
std     5.0  10000.0  1000.0
min    25.0  50000.0  5000.0
25%    27.5  55000.0  5500.0
50%    30.0  60000.0  6000.0
75%    32.5  65000.0  6500.0
max    35.0  70000.0  7000.0
Age          30.0
Salary    60000.0
Bonus      6000.0
dtype: float64

In [102]:
df.Tips = df.Salary * 0.01
df

      Name  Age  Salary   Bonus   Tips
a    Alice   25   50000  5000.0  500.0
b      Bob   30   60000  6000.0  600.0
c  Charlie   35   70000  7000.0  700.0

In [100]:
df['Tips'] = df['Salary'] * 0.01
df

      Name  Age  Salary   Bonus   Tips
a    Alice   25   50000  5000.0  500.0
b      Bob   30   60000  6000.0  600.0
c  Charlie   35   70000  7000.0  700.0

#### Summary
* DataFrame: Two-dimensional, like a table with rows & columns.
* Series: One-dimensional, similar to a list.
* Indexing: Use loc[] for labels, iloc[] for positions

# MUJ

In [48]:
d = {"Price":[12,15,19,18,17,15],"Sales":[450,158,568,259,365,487], "Purchase":[45,48,49,68,25,58],"Returns":[5,2,4,8,9,6]}
df1 = pd.DataFrame(d)
df1

   Price  Sales  Purchase  Returns
0     12    450        45        5
1     15    158        48        2
2     19    568        49        4
3     18    259        68        8
4     17    365        25        9
5     15    487        58        6

In [64]:
df1.loc[:,"Sales"]

0    450
1    158
2    568
3    259
4    365
5    487
Name: Sales, dtype: int64

In [66]:
df1.Sales

0    450
1    158
2    568
3    259
4    365
5    487
Name: Sales, dtype: int64

In [70]:
df1.iloc[:,0:2]

   Price  Sales
0     12    450
1     15    158
2     19    568
3     18    259
4     17    365
5     15    487

In [146]:
d = {"Players":["Sachin","Sehwag","Virat"], "Matches":[500,485,256]}
d1 = {"Players":["Sachin","Sehwag","Koli", "Dhoni"], "Centuries":[100,50,101,65]}
df1 = pd.DataFrame(d)
df2 = pd.DataFrame(d1)
print(df1,"\n\n",df2)

  Players  Matches
0  Sachin      500
1  Sehwag      485
2   Virat      256

   Players  Centuries
0  Sachin        100
1  Sehwag         50
2    Koli        101
3   Dhoni         65

In [148]:
df3 = pd.merge(df1,df2,on = "Players", how = "outer")
df3

  Players  Matches  Centuries
0   Dhoni      NaN       65.0
1    Koli      NaN      101.0
2  Sachin    500.0      100.0
3  Sehwag    485.0       50.0
4   Virat    256.0        NaN

In [150]:
df3 = pd.merge(df1,df2,on = "Players", how = "left")
df3

  Players  Matches  Centuries
0  Sachin      500      100.0
1  Sehwag      485       50.0
2   Virat      256        NaN

In [152]:
df3 = pd.merge(df1,df2,on = "Players", how = "right")
df3

  Players  Matches  Centuries
0  Sachin    500.0        100
1  Sehwag    485.0         50
2    Koli      NaN        101
3   Dhoni      NaN         65

In [158]:
df3 = pd.merge(df1,df2,on = "Players")
df3

  Players  Matches  Centuries
0  Sachin      500        100
1  Sehwag      485         50